package baekjoon.dp;

/**
 * ------------------------------------------------------------
 *  파일명  : Main14501.java
 *  설명 : 첫째 줄에 N (1<=N<=15)이 주어진다.
 *         둘째 줄부터 N개의 줄에 T와 P가 공백으로 구분되어서 주어지며, 1일부터 N일까지 순서대로 주어진다.(1<=T<=5, 1<=P<=1000)
 *         첫쨰 줄에 백준이가 얻을 수있는 최대 이익을 출력한다.
 *  작성자  : 작성자 이름
 *  작성일  : 2025-06-06
 *  수정이력   :
 *   - 2025-06-06 작성자 이름 최초 생성
 * ------------------------------------------------------------
 */
public class Main14501 {
    
    public static void main(String[] args){

    }

    public void topdown(){

    }

    public void bottomup(){

    }
}
